{"field": "Math", "url": "http://setosa.io/ev/image-kernels/", "topic": "Image processing with convolution kernels", "interaction_forms": [{"label": "Pixel Inspection", "description": "Hovering over a pixel in either the input or output image highlights the corresponding 3x3 pixel block in the input image and the kernel values, showing the calculation that produces the output pixel's value."}, {"label": "Kernel Selection", "description": "Selecting a different kernel type from the provided list changes the values in the 3x3 kernel matrix, which updates the output image with the corresponding visual effect."}, {"label": "Custom Kernel Editing", "description": "Users can directly edit the numerical values within the 3x3 kernel matrix when the 'custom' kernel is selected, which dynamically updates the output image to reflect the custom filter."}, {"label": "Image Upload", "description": "Uploading a custom image replaces the default image as the input for the kernel convolution."}, {"label": "Live Video Input", "description": "Activating the live video feed uses the webcam stream as the real-time input image for the kernel operations."}]}
{"field": "Math", "url": "http://setosa.io/ev/pi/", "topic": "The definition of Pi as the ratio of circumference to diameter", "interaction_forms": [{"label": "Wrap Size", "description": "Dragging the slider adjusts the circle's diameter, which proportionally changes the circumference, while the calculated ratio of circumference to diameter remains constant."}]}
{"field": "Math", "url": "http://setosa.io/ev/exponentiation/", "topic": "Exponential growth as repeated multiplication", "interaction_forms": [{"label": "Change Growth Factor", "description": "Clicking the 'x2', 'x3', or 'x4' buttons sets the multiplication factor for each step in the exponential growth visualization."}, {"label": "Adjust Animation Steps", "description": "A slider labeled 'steps' controls the number of discrete growth intervals shown in the animation."}, {"label": "Control Animation Speed", "description": "A slider labeled 'speed' adjusts the playback speed of the visualization's animation."}, {"label": "Restart Animation", "description": "A 'Restart' button replays the current growth animation from the beginning."}]}
{"field": "Math", "url": "http://euclidthegame.com/", "topic": "Euclidean geometric constructions with compass and straightedge.", "interaction_forms": [{"label": "Select Tool", "description": "Clicking an icon from the tool palette selects a geometric construction tool, such as a line, circle, or point."}, {"label": "Define Construction", "description": "Clicking on points or existing geometric objects on the canvas defines the parameters for the selected tool, causing a new object to be drawn."}, {"label": "Advance Level", "description": "When the constructed geometric objects satisfy the goal conditions for the current level, the game automatically validates the solution and proceeds to the next challenge."}]}
{"field": "Math", "url": "https://morr.cc/mandelbrot/", "topic": "The Mandelbrot set's generation from iterating a function on complex numbers.", "interaction_forms": [{"label": "Repositioning a complex number", "description": "Dragging the flag marker repositions a point on the complex plane, causing the visualization to recalculate and redraw the resulting path of the iterated function."}, {"label": "Controlling iteration steps", "description": "Moving the step slider sets the number of function iterations to perform, which animates the visualized path of the point from its origin to the selected step count."}, {"label": "Drawing the set", "description": "In specific demonstrations, dragging the flag marker over the canvas calculates whether each point is in the set and colors the pixel accordingly, allowing the user to scribble the fractal into existence."}, {"label": "Zooming the view", "description": "Clicking on the main fractal visualization zooms into that point, while middle-clicking zooms out to reveal a wider view."}, {"label": "Resetting the view", "description": "Clicking the \"Reset zoom\" button returns the fractal visualization to its original default position and magnification level."}]}
{"field": "Math", "url": "http://pomax.github.io/bezierinfo/", "topic": "Mathematical definition and geometric construction of Bézier curves", "interaction_forms": [{"label": "Draggable Points", "description": "Dragging the start, end, or control points modifies the shape of the Bézier curve and updates any associated visualizations like component functions, bounding boxes, or derivatives."}, {"label": "Slider / Parameter Control", "description": "Adjusting a slider changes a specific parameter, such as the interpolation value 't', rational weights, or the number of approximation segments, which dynamically updates the visualization."}, {"label": "Keyboard Input", "description": "Pressing the up and down arrow keys increments or decrements a parameter, such as the interpolation ratio, curve order, or the number of segments used in a curve approximation."}, {"label": "Cursor Position Tracking", "description": "Moving the mouse cursor over a graphic provides real-time input to project the cursor's location onto the curve or to select a parameter value based on horizontal position."}, {"label": "Algorithmic Step-through", "description": "Clicking a button advances an algorithm by a single step, such as iterating through the recursive subdivision process for finding curve intersections."}, {"label": "Point Creation", "description": "Clicking on the background of a visualization adds a new data point, which is then used to recalculate and update a curve fitted to the set of points."}, {"label": "Direct Curve Manipulation (Molding)", "description": "Clicking and dragging a point on the curve itself reshapes it in real-time as the system continuously recalculates the underlying control points to make the curve pass through the cursor's current position."}]}
{"field": "Math", "url": "http://jackschaedler.github.io/circles-sines-signals/", "topic": "Fourier decomposition of signals", "interaction_forms": [{"label": "Select Signal Type", "description": "Selecting a signal from the dropdown menu (e.g., Triangle, Sawtooth, Square) updates the visualization to show the specific combination of rotating circles required to generate that waveform."}, {"label": "Adjust Series Terms", "description": "Dragging the 'Terms' slider changes the number of circles and corresponding sine waves used in the Fourier series, altering the accuracy of the approximation to the target signal."}, {"label": "Control Time", "description": "Dragging the time slider scrubs the animation forwards or backwards, showing the circular paths and the resulting signal being drawn over time."}, {"label": "Draw Custom Signal", "description": "Switching to the 'drawing' tab allows the user to draw a custom periodic function with the mouse, which the visualizer then automatically decomposes into its constituent Fourier series circles."}]}
{"field": "Math", "url": "http://setosa.io/ev/conditional-probability/", "topic": "Conditional probability and sample space", "interaction_forms": [{"label": "Filter by Event", "description": "Clicking on the buttons for event 'A' or 'B' filters the population to only include outcomes where that event occurred, updating the probabilities to be conditional on that event."}, {"label": "Change Perspective", "description": "Switching between the 'P(B|A)' and 'P(A|B)' perspectives rearranges the visualization to illustrate the calculation for each respective conditional probability."}, {"label": "View World Population", "description": "Selecting the 'world' view removes all conditions, showing the entire sample space and the unconditional probabilities of each event."}, {"label": "Adjust Frequencies", "description": "Dragging the handles on the 'drop frequency' chart changes the base probabilities of events A and B, which dynamically updates the entire visualization."}]}
{"field": "Math", "url": "http://tinlizzie.org/histograms/", "topic": "Parameter sensitivity of histograms", "interaction_forms": [{"label": "Select dataset", "description": "Buttons allow switching between multiple sample datasets to observe how parameter choices affect different data distributions."}, {"label": "Adjust bin offset (slider)", "description": "A slider continuously shifts the bin boundaries horizontally along the number line, which redistributes data points and alters the resulting bin counts."}, {"label": "Adjust bin width (slider)", "description": "A slider continuously adjusts the width of all bins simultaneously, changing the number of bins and the granularity of the data summary."}, {"label": "Select parameter value (discrete)", "description": "Users can click on specific predefined numerical values for bin width or offset to directly set that parameter."}, {"label": "Toggle parameter sweep", "description": "A button overlays a semi-transparent 'cloud' of all possible histograms generated by sweeping through a range of values for a given parameter."}, {"label": "Toggle density plot", "description": "A checkbox switches the vertical axis from representing raw counts to representing density, which normalizes bin heights by their width."}, {"label": "Switch bin openness", "description": "A toggle switches between left-open and right-open bins, changing how data points that fall exactly on a boundary are assigned to a bin."}, {"label": "Adjust bin offset (drag)", "description": "Directly dragging the histogram bars horizontally adjusts the bin offset, leaving a faint trail of previous histogram shapes to show the history of changes."}, {"label": "Adjust bin width (drag)", "description": "A dedicated handle can be dragged horizontally to directly manipulate and change the width of the histogram bins."}]}
{"field": "Math", "url": "http://www.loper-os.org/bad-at-entropy/manmach.html", "topic": "Predictability of human-generated binary sequences", "interaction_forms": [{"label": "Select Binary Choice", "description": "Clicking the 'Zero' or 'One' buttons or pressing the corresponding keyboard keys submits a choice, prompting the machine to make its own prediction and updating the game's score."}, {"label": "Reset Game", "description": "Clicking the 'Reset' button or pressing the 'Space' key on the keyboard clears the history of choices and resets the scores to zero."}]}
{"field": "Math", "url": "http://rpsychologist.com/d3/CI/", "topic": "The frequentist interpretation of confidence intervals and their relationship to a population parameter.", "interaction_forms": [{"label": "Draw Samples Slider", "description": "Dragging the slider initiates a simulation that repeatedly draws samples, calculates and plots their confidence intervals, and updates a running tally of how many intervals contain the true population mean."}, {"label": "Confidence Level Slider", "description": "Adjusting the slider changes the confidence level, which immediately alters the width of the calculated confidence intervals in the visualization."}, {"label": "Sample Size Control", "description": "Increasing or decreasing the sample size for each draw results in narrower or wider confidence intervals, respectively, for all subsequent samples."}, {"label": "Simulation Speed Control", "description": "The speed of the simulation is increased or decreased by clicking the respective buttons, controlling the rate at which new sample confidence intervals are generated and displayed."}, {"label": "Pause Button", "description": "Clicking the button toggles the simulation between a paused and running state, halting or resuming the continuous drawing of new samples."}]}
{"field": "Math", "url": "http://setosa.io/ev/markov-chains/", "topic": "Probabilistic state transitions in Markov chains", "interaction_forms": [{"label": "Edit Transition Matrix", "description": "Clicking a cell within the transition matrix allows for editing its numerical probability value, which visually updates the thickness of the corresponding arrows in the state graph."}, {"label": "Reposition Nodes", "description": "Clicking and dragging the nodes (states) in the graph visualization repositions them to alter the visual layout without affecting the transition logic."}, {"label": "Control Simulation Speed", "description": "Dragging the 'speed' slider to the left or right increases or decreases the rate at which the random walk simulation transitions between states."}, {"label": "Load Examples", "description": "Clicking the 'ex1', 'ex2', 'ex3', or 'randomly' links loads different pre-configured transition matrices and corresponding state graph visualizations."}, {"label": "Edit Model via Text", "description": "Directly editing the text representation of the transition matrix allows for adding, removing, or renaming states and probabilities, which regenerates the entire model and visualization."}]}
{"field": "Math", "url": "http://setosa.io/ev/ordinary-least-squares-regression/", "topic": "Ordinary Least Squares regression", "interaction_forms": [{"label": "Move Data Points", "description": "Dragging any data point on the 2D scatter plot causes the regression line and the beta coefficients in the associated equation to update in real-time."}, {"label": "Adjust Beta Coefficients", "description": "Manipulating the interactive dials for the line's intercept and slope changes the regression line's position and resizes the corresponding squares that visualize the error for each point."}, {"label": "Move 3D Data Points", "description": "Dragging a data point in either of the two scatter plots for the two independent variables updates its position in both plots and re-calculates the 3D regression plane to fit the new data."}, {"label": "Adjust 3D Beta Coefficients", "description": "Adjusting the three beta coefficient dials modifies the regression plane's equation and its orientation, which is shown as two separate lines on the 2D scatter plots."}]}
{"field": "Math", "url": "http://setosa.io/ev/principal-component-analysis/", "topic": "Principal components analysis for dimensionality reduction", "interaction_forms": [{"label": "Repositioning data points", "description": "Dragging points in the 2D scatter plot causes the principal component axes to re-calculate and rotate in real-time while updating the corresponding 1D and 2D projections of the data."}, {"label": "Rotating the data cloud", "description": "Dragging the 3D scatter plot rotates the data cloud, allowing the user to view the data from different angles and perspectives."}, {"label": "Projecting onto principal components", "description": "Clicking the 'Show PCA' button automatically rotates the 3D data to the optimal viewpoint along its first two principal components."}, {"label": "Resetting the view", "description": "Clicking the 'reset' button returns the 3D data visualization to its original, default orientation."}]}
{"field": "Math", "url": "http://flowingdata.com/2015/09/23/years-you-have-left-to-live-probably/", "topic": "Probabilistic life expectancy and mortality rates based on current age and sex.", "interaction_forms": [{"label": "Select Sex", "description": "Choosing a demographic group (female or male) changes the underlying mortality data, which recalculates and re-simulates the probabilities of remaining lifespan."}, {"label": "Enter Age", "description": "Inputting a number for current age sets the starting point for the simulation, which then visualizes the distribution of possible remaining years of life."}, {"label": "Toggle Simulation Speed", "description": "Switching between 'Slow' and 'Fast' modes alters the speed at which the simulation runs and the corresponding visualization unfolds."}]}
{"field": "Math", "url": "http://setosa.io/ev/eigenvectors-and-eigenvalues/", "topic": "Eigenvectors and eigenvalues of a linear transformation.", "interaction_forms": [{"label": "Modify Transformation Matrix", "description": "Editing the values of the 2x2 matrix adjusts the linear transformation, causing the transformed vector, grid lines, and calculated eigenspaces to update."}, {"label": "Drag Vector", "description": "Dragging the vector on the 2D plane changes its components, and the transformed vector simultaneously updates to show the result of the matrix multiplication."}]}
{"field": "Math", "url": "http://ncase.me/matrix/", "topic": "Geometric interpretation of 2x2 matrix transformations.", "interaction_forms": [{"label": "Vector Manipulation", "description": "Dragging the basis vectors î and ĵ updates the matrix values and transforms the grid space."}, {"label": "Direct Matrix Input", "description": "Typing numbers into the 2x2 matrix cells applies the corresponding linear transformation to the grid."}, {"label": "Preset Transformations", "description": "Clicking buttons for predefined transformations like 'Scale,' 'Shear,' or 'Rotate' instantly applies them to the matrix and the grid."}, {"label": "Drawing Custom Shapes", "description": "Drawing a shape on the input grid renders the same shape on the output grid after being modified by the current matrix transformation."}, {"label": "Determinant Visualization", "description": "Clicking the determinant value animates the transformation of the unit square to visually represent how its area changes."}, {"label": "Matrix Transposition", "description": "Clicking the 'Transpose' button swaps the matrix's non-diagonal elements and updates the grid to the new transformation."}, {"label": "Matrix Inversion", "description": "Clicking the 'Inverse' button calculates and applies the inverse transformation to the matrix and grid, visually undoing the current transformation."}, {"label": "Sequential Transformations", "description": "Clicking the combined transformation examples at the bottom applies a sequence of two transformations to the matrix and the grid."}]}
{"field": "Math", "url": "https://marimo.io/p/@marimo/embedding-visualizer", "topic": "Dimensionality reduction of high-dimensional vectors for visualization", "interaction_forms": [{"label": "Select dataset", "description": "Choosing a dataset from a dropdown menu updates the scatter plot to show the corresponding embeddings."}, {"label": "Select algorithm", "description": "Selecting a dimensionality reduction algorithm (PCA, t-SNE, or UMAP) recalculates and animates the transition of the data points to their new positions in the 2D space."}, {"label": "Adjust algorithm parameters", "description": "Modifying sliders for algorithm-specific parameters, such as perplexity or number of neighbors, causes the visualization to re-compute and update the embedding projection."}, {"label": "Hover over data points", "description": "Moving the cursor over a point in the scatter plot highlights it and displays a tooltip with its corresponding label or metadata."}]}
{"field": "Math", "url": "https://marimo.io/@public/signal-decomposition", "topic": "Signal decomposition into sinusoidal components", "interaction_forms": [{"label": "Signal Type", "description": "Selecting a new signal type from the dropdown menu changes the target signal being decomposed and visualized."}, {"label": "Number of Sinusoids", "description": "Adjusting the slider changes the number of sine waves used in the reconstruction, altering the fidelity of the resulting composite signal."}, {"label": "Frequency", "description": "Modifying the slider adjusts the fundamental frequency of the selected signal."}, {"label": "Play Audio", "description": "Clicking the play button generates and plays the sound of the currently visualized waveform."}]}
{"field": "Math", "url": "https://marimo.io/p/@marimo/interactive-matrices", "topic": "The effect of 2x2 matrix transformations on a 2D vector space.", "interaction_forms": [{"label": "Matrix element sliders", "description": "Adjusting the four sliders directly modifies the individual elements of the 2x2 transformation matrix, which visually updates the transformed grid and output vector."}, {"label": "Preset matrix selector", "description": "Selecting a transformation type from the dropdown menu, such as 'Shear' or 'Rotation', automatically sets the matrix element sliders to the corresponding preset values."}, {"label": "Draggable input vector", "description": "Dragging the head of the input vector 'v' in the 'Before' plot changes its components, and the 'After' plot simultaneously updates to show the new transformed vector 'Av'."}]}
{"field": "Math", "url": "http://acko.net/blog/how-to-fold-a-julia-fractal/", "topic": "Generation of Julia set fractals through the iteration of complex functions.", "interaction_forms": [{"label": "Scroll-driven Slideshow", "description": "Scrolling the page progresses through a sequence of narrative steps, each accompanied by a synchronized animation or visualization."}, {"label": "Animation Controls", "description": "Clicking on 'Previous/Next Slide' buttons navigates between animated steps, while 'Repeat Animation' replays the current visual sequence."}, {"label": "Draggable Complex Numbers", "description": "Dragging the endpoints of two vectors on the complex plane dynamically updates a third vector representing their geometric product."}, {"label": "Power Slider", "description": "Adjusting a slider changes the exponent of a complex power function, causing the visualization of the complex plane to fold or unfold in real-time."}, {"label": "Draggable Julia Constant", "description": "Dragging a point representing the constant 'c' on the complex plane interactively morphs the shape of the corresponding Julia set fractal."}, {"label": "Pan and Zoom Fractal Map", "description": "Clicking and dragging or scrolling within the Mandelbrot set view pans and zooms into its structure, which simultaneously updates the corresponding Julia set visualization."}]}
{"field": "Math", "url": "http://setosa.io/ev/sine-and-cosine/", "topic": "The relationship between the unit circle and the sine and cosine functions.", "interaction_forms": [{"label": "Adjust Angle", "description": "Dragging the point on the unit circle changes the angle, which updates the visual representation of the right triangle and the calculated sine and cosine values."}, {"label": "Resize Triangle", "description": "A slider controls the size of the triangle, demonstrating that while the side lengths change, the sine and cosine ratios for the selected angle remain constant."}, {"label": "Animate Wave Generation", "description": "Clicking the play button triggers an animation that traces the unit circle to generate and draw the corresponding sine and cosine wave forms."}, {"label": "Move Point", "description": "Dragging a point on the Cartesian plane dynamically updates its Cartesian (x,y) and polar (r, θ) coordinates."}, {"label": "Adjust Radius", "description": "A slider adjusts the radius 'r' in the polar coordinate system, which updates the point's position and its Cartesian (x,y) coordinates."}, {"label": "Adjust Theta", "description": "A slider adjusts the angle 'θ' in the polar coordinate system, which updates the point's position and its Cartesian (x,y) coordinates."}]}
{"field": "Math", "url": "https://marimo.io/@public/surfaces", "topic": "Parametric and implicit 3D surfaces", "interaction_forms": [{"label": "Select Surface Type", "description": "A dropdown menu selects the type of surface to be rendered, offering options such as paraboloid, saddle, sphere, or torus."}, {"label": "Adjust Surface Parameters", "description": "A set of sliders adjusts the coefficients and radii that define the shape of the currently selected surface, updating the visualization in real-time."}, {"label": "Modify Axis Limits", "description": "Pairs of number inputs set the visible range (minimum and maximum) for each of the x, y, and z axes."}, {"label": "Manipulate 3D View", "description": "The 3D plot can be rotated by clicking and dragging the cursor, changing the camera's viewing angle of the surface."}]}
{"field": "Math", "url": "http://incredible.pm/", "topic": "Natural deduction proofs", "interaction_forms": [{"label": "Select Task", "description": "Clicking a task from the list of logical problems sets up the initial premises and the conclusion to be proven on the workspace."}, {"label": "Add Logic Block", "description": "Clicking on a logic rule from the sidebar adds the corresponding block, representing a step of inference, onto the proof canvas."}, {"label": "Connect Blocks", "description": "Dragging from an output port of one block to an input port of another creates a wire, representing the flow of a proposition from one proof step to another."}, {"label": "Select Block(s)", "description": "Clicking a block selects it for manipulation, and holding shift while clicking allows multiple blocks to be added to the current selection."}, {"label": "Delete Block(s)", "description": "Pressing the delete or backspace key removes any currently selected blocks and their connections from the proof canvas."}, {"label": "Create Custom Block", "description": "After selecting a group of connected blocks, entering a name and clicking 'Add' combines them into a single, reusable custom block available in the sidebar."}, {"label": "Pan and Zoom", "description": "Using the dedicated UI buttons allows the user to zoom in or out on the canvas, which can also be panned by dragging the background."}, {"label": "Undo/Redo", "description": "Using the dedicated buttons or keyboard shortcuts reverts the last action or re-applies a previously undone action."}]}
{"field": "Algorithms", "url": "https://bost.ocks.org/mike/algorithms/", "topic": "Algorithmic processes for sampling, shuffling, sorting, and maze generation.", "interaction_forms": [{"label": "Play Algorithm Animation", "description": "Clicking a 'Play' button initiates an animation that visually demonstrates the step-by-step process of a specific algorithm, such as placing samples, shuffling or sorting elements, or generating a maze."}, {"label": "Toggle Image Comparison", "description": "Holding the mouse button down on algorithmically generated images reveals the original source image underneath, allowing for a direct visual comparison of the sampling quality."}]}
{"field": "Algorithms", "url": "http://distill.pub/2016/misread-tsne/", "topic": "The behavior and interpretation of t-SNE visualizations", "interaction_forms": [{"label": "Dataset Selection", "description": "Selecting a dataset from the dropdown menu resets the visualization with a new initial data structure for the algorithm to process."}, {"label": "Perplexity Control", "description": "Adjusting the perplexity slider modifies a key hyperparameter of the t-SNE algorithm, changing the balance between local and global data aspects in the resulting visualization."}, {"label": "Epsilon Control", "description": "Modifying the epsilon (learning rate) slider alters the optimization step size, which influences the speed and stability of the algorithm's convergence."}, {"label": "Dataset Parameter Control", "description": "When a parametric dataset is chosen, a unique slider appears that allows the user to change a property of the source data itself, such as the number of points in a grid."}, {"label": "Animation Control", "description": "Users can play, pause, or restart the iterative optimization process using dedicated buttons, allowing for continuous observation or interruption of the algorithm."}, {"label": "Iteration Scrubber", "description": "A slider controlling the current step number allows for manually scrubbing back and forth through the optimization timeline to observe the visualization at any specific iteration."}]}
{"field": "Algorithms", "url": "http://bevacqua.github.io/promisees/", "topic": "Execution flow of JavaScript promise chains", "interaction_forms": [{"label": "Code Input", "description": "Editing the JavaScript code dynamically updates the promise chain visualization to match the new logic."}, {"label": "Example Presets", "description": "Clicking a preset button loads a specific promise-based code example into the editor and its corresponding visualization."}, {"label": "Promise Trigger", "description": "Clicking a promise in the visual chain initiates its asynchronous execution, showing whether it resolves or rejects and how this outcome flows through the connected promises."}, {"label": "Speed Control", "description": "Adjusting the speed control changes the playback rate of the promise execution and state transition animations."}]}
{"field": "Algorithms", "url": "http://jackschaedler.github.io/handwriting-recognition/", "topic": "Feature extraction for single-stroke character recognition", "interaction_forms": [{"label": "Drawing Canvas", "description": "Drawing a continuous line on a gridded canvas renders the user's stroke."}, {"label": "Quantization Toggling", "description": "Clicking buttons toggles a preset curve between its ideal smooth path and its quantized, grid-snapped representation."}, {"label": "Smoothing Demonstration", "description": "Selecting different percentage buttons applies varying levels of a smoothing algorithm to a preset quantized curve, altering its final shape."}, {"label": "Smoothing Control", "description": "Adjusting a slider transforms a user-drawn stroke by applying a variable smoothing factor, altering its jaggedness in real-time."}, {"label": "Thinning Demonstration", "description": "Clicking buttons applies different aggression levels of a thinning algorithm to a preset smoothed curve, showing which data points are kept or discarded."}, {"label": "Thinning Control", "description": "Modifying a slider re-processes a user-drawn stroke to discard a variable number of redundant data points based on the size of a \"thinning square\"."}, {"label": "Direction Calculation", "description": "Dragging a point relative to a fixed origin displays the calculated cardinal direction based on the aspect ratio of the rectangle connecting the two points."}, {"label": "Curvature Display", "description": "Drawing a stroke on a canvas renders the path overlaid with arrows indicating the calculated cardinal direction for each segment."}, {"label": "Curvature Change Display", "description": "Drawing on a canvas highlights only the segments where the cardinal direction changes, while graying out redundant directional segments."}, {"label": "Corner Detection Control", "description": "Manipulating a slider changes the angle threshold for corner detection, which adds or removes corner markers on a user-drawn stroke."}, {"label": "Stroke Feature Display", "description": "Drawing a character on a canvas generates and displays a detailed description of the stroke's features, including its start/end grid positions and corner locations."}, {"label": "Live Recognition Canvas", "description": "Drawing a single-stroke character shows a continuously updated list of potential matches and displays the final recognized symbol with a textual justification."}]}
{"field": "Algorithms", "url": "https://www.jasondavies.com/bloomfilter/", "topic": "The Bloom filter data structure", "interaction_forms": [{"label": "Add Key", "description": "Typing a string into the first input field and clicking 'Add' computes multiple hash functions, causing the bits at the resulting indices in the vector to become set and highlighted."}, {"label": "Test Key", "description": "Typing a string into the second input field computes its hash values, highlights the corresponding bits in the vector, and displays a message indicating if the item is definitely not in the set or probably in the set."}]}
{"field": "Algorithms", "url": "http://www.benfrederickson.com/calculating-the-intersection-of-3-or-more-circles/", "topic": "Geometric intersection of multiple circles", "interaction_forms": [{"label": "Start/Stop Simulation", "description": "Clicking the 'Start' button initiates an animation demonstrating the selected approximation or calculation method for finding the intersection area of the circles."}, {"label": "Select Number of Circles", "description": "Clicking on a number from '1 Circle' to '8 Circles' changes the number of circles displayed in the visualization for which the intersection area is being calculated."}, {"label": "Toggle Grid", "description": "Clicking the 'Grid' button toggles the visibility of a background grid in the visualization area."}, {"label": "Randomize Circle Positions", "description": "Clicking the 'Randomize' button instantly repositions the circles to a new random configuration within the view."}, {"label": "Drag and Move Circles", "description": "Dragging any individual circle moves it around the canvas, causing the visualization and the corresponding area calculation to update in real-time."}]}
{"field": "Algorithms", "url": "http://bl.ocks.org/1wheel/464141fe9b940153e636", "topic": "The Bentley–Ottmann algorithm for finding intersections in a set of line segments.", "interaction_forms": [{"label": "Move Line", "description": "Dragging the endpoints of a line segment moves it, and all intersections are recalculated and displayed in real-time."}, {"label": "Add Point", "description": "Clicking anywhere on the canvas adds a new point, and every two points automatically form a new line segment."}, {"label": "Remove Line", "description": "Right-clicking on an endpoint of a line segment removes the entire segment from the view."}]}
{"field": "Algorithms", "url": "https://morr.cc/split-packing/", "topic": "An algorithm for packing circles into containers", "interaction_forms": [{"label": "Add/Remove Circles", "description": "Clicking within the container adds a circle, while clicking on an existing circle removes it, allowing the user to define the packing problem."}, {"label": "Select Container", "description": "The user can cycle through various container shapes, such as squares and triangles, to pack the circles into."}, {"label": "Run Packing Algorithm", "description": "Initiating the process animates the execution of the split-packing algorithm, showing how the circles are rearranged to fit."}, {"label": "Reset", "description": "A control is available to clear the current state and return the visualization to its initial default configuration."}]}
{"field": "Algorithms", "url": "http://roadtolarissa.com/blog/2015/01/04/coloring-maps-with-d3/", "topic": "Data classification methods for choropleth maps", "interaction_forms": [{"label": "Select Scale Type", "description": "Clicking a scale name (Linear, Quantize, Quantile, or Jenks) updates the central code block, the left scatterplot, and the right map to show how each method transforms values into colors."}, {"label": "Select Data Scenario", "description": "For the Quantize and Quantile scales, clicking on a specific data scenario text (e.g., 'Outliers compressed') changes the underlying data distribution, which updates the scatterplot and recolors the map to demonstrate the weaknesses of that scale."}]}
{"field": "Algorithms", "url": "http://bl.ocks.org/enjalot/bd552e711b8325c64729", "topic": "Distortion in 2D map projections", "interaction_forms": [{"label": "Pan Map", "description": "Dragging the 2D map projection pans the map and simultaneously rotates the 3D globe to correspond to the new center point."}, {"label": "Zoom Map", "description": "Scrolling the mouse wheel over the 2D map projection zooms the map view in or out."}, {"label": "Select Projection", "description": "Choosing a map projection from the dropdown menu redraws the 2D map to show how that projection distorts the Earth's surface."}]}
{"field": "Algorithms", "url": "http://blog.jrheard.com/procedural-dungeon-generation-cellular-automata", "topic": "Procedural map generation using cellular automata", "interaction_forms": [{"label": "Chance to be Filled Slider", "description": "Adjusts the probability that a cell is initially 'alive,' which changes the density of the starting grid and reruns the simulation."}, {"label": "Birth Threshold Slider", "description": "Modifies the minimum number of 'alive' neighbors required to turn a 'dead' cell into an 'alive' one, affecting the growth of structures in the generated map."}, {"label": "Survival Threshold Slider", "description": "Changes the minimum number of 'alive' neighbors required for an 'alive' cell to remain alive, which affects the erosion and thinning of structures."}, {"label": "Number of Iterations Slider", "description": "Controls the total number of simulation steps applied to the grid, showing the progressive formation of the cave-like structures."}, {"label": "Generate Another", "description": "Resets the simulation with a new random initial grid based on the current parameter settings."}, {"label": "Interactive Code Snippets", "description": "Allows for the modification and execution of code parameters directly within the text to observe their effects on the output grid."}]}
{"field": "Algorithms", "url": "http://www.r2d3.us/visual-intro-to-machine-learning-part-1/", "topic": "Decision tree classification", "interaction_forms": [{"label": "Scroll-based Animation", "description": "Scrolling down the page animates the visualization through a step-by-step narrative that builds a decision tree model from a dataset."}, {"label": "Adjusting the Split Point", "description": "Dragging the decision boundary on a histogram interactively re-classifies the data points and updates corresponding pie charts that show the trade-off in accuracy."}, {"label": "Hovering over Data Points", "description": "Mousing over a data point in the scatterplots highlights the point and reveals its specific data values."}, {"label": "Hovering over Tree Branches", "description": "Mousing over a branch in the decision tree diagram highlights the corresponding subset of data points being classified in the scatterplots."}, {"label": "Simulating Model Prediction", "description": "Clicking to run the model sends training or test data points animating through the decision tree to show how it classifies data."}]}
{"field": "Algorithms", "url": "https://jalammar.github.io/visual-interactive-guide-basics-neural-networks/", "topic": "Training simple neural networks for regression and classification.", "interaction_forms": [{"label": "Manual Regression Fitting", "description": "Users can manipulate sliders for 'Weight' and 'Bias' to manually fit a regression line to data points, which dynamically updates the line's position on a graph and shows the corresponding change in the calculated error value."}, {"label": "Automated Training Steps", "description": "Users can click buttons to trigger steps of the Gradient Descent algorithm, which automatically adjusts the weight and bias to minimize error, with the results reflected in plots of the regression line, an error log, and the error surface."}, {"label": "Multi-variable Parameter Tuning", "description": "Users can operate three separate sliders corresponding to two weights and a bias to observe how adjusting parameters for a multi-variable model affects its total calculated error."}, {"label": "Configuring Network Architecture", "description": "Users can select the number of input features and output classes, which procedurally generates and displays the corresponding neural network architecture diagram."}]}
{"field": "Algorithms", "url": "http://neuralnetworksanddeeplearning.com/", "topic": "Neural networks and deep learning", "interaction_forms": []}
{"field": "Algorithms", "url": "http://playground.tensorflow.org/", "topic": "Neural network architecture and training", "interaction_forms": [{"label": "Start/Stop Training", "description": "Clicking the play/pause button starts or stops the iterative training process, which updates the model's weights and the output visualization in real-time."}, {"label": "Single-Step Training", "description": "Pressing the step button advances the training by a single epoch, allowing for a granular observation of the model's learning progression."}, {"label": "Data Set Selection", "description": "Users can select from different predefined data sets, which changes the distribution of data points that the network is tasked to learn."}, {"label": "Input Feature Selection", "description": "Checking or unchecking various input features determines which data transformations are fed into the first layer of the neural network."}, {"label": "Modify Network Depth", "description": "Buttons allow for the addition or removal of hidden layers in the network, altering its depth and complexity."}, {"label": "Modify Network Width", "description": "The number of neurons within each hidden layer can be increased or decreased, changing the width and representational capacity of that layer."}, {"label": "Hyperparameter Configuration", "description": "Drop-down menus and sliders allow for the modification of hyperparameters such as learning rate, activation function, and regularization, which directly influences the training dynamics."}, {"label": "Data and Training Control", "description": "Sliders for noise, batch size, and the ratio of training to test data allow users to modify the data set and control the training procedure."}, {"label": "Problem Type Selection", "description": "Users can switch the task of the neural network between classification and regression, which changes the output layer and the loss function used for training."}, {"label": "Neuron Connection Visualization", "description": "Hovering the mouse over the connection between neurons displays the specific weight of that connection, providing insight into the learned model parameters."}]}
{"field": "Algorithms", "url": "http://distill.pub/2016/augmented-rnns/", "topic": "Attention mechanisms in augmented Recurrent Neural Networks", "interaction_forms": [{"label": "NTM Memory Access", "description": "Hovering over the read and write heads in the animated diagram reveals the attention patterns across the memory bank at each time step."}, {"label": "Machine Translation Attention", "description": "Hovering over a word in the generated French translation highlights the corresponding English words from the source sentence that the model attended to."}, {"label": "Speech Recognition Attention", "description": "Hovering over a character in the transcribed text highlights the parts of the input audio waveform that the model focused on to generate that character."}, {"label": "Image Captioning Attention", "description": "Hovering over a word in the generated image caption reveals the specific region of the image the model was looking at by overlaying a visual heatmap."}]}
{"field": "Algorithms", "url": "http://distill.pub/2016/handwriting/", "topic": "Generative recurrent neural networks for handwriting", "interaction_forms": [{"label": "Handwriting Input", "description": "Draw on a canvas to provide a seed for the neural network, which then continues generating handwriting in a similar style."}, {"label": "Animation Control", "description": "Play and pause the visualization of both user-seeded and pre-generated handwriting."}, {"label": "Parameter Control", "description": "Adjust sliders to change the length of the predicted handwriting and the amount of stylistic variation in the generated strokes."}, {"label": "Sample Selection", "description": "Click buttons to switch between different pre-written or model-generated handwriting samples to see how the model analyzes or generates them."}, {"label": "Possibility Steps", "description": "Use a slider to control the number of future branching possibilities shown in the visualization of the model's potential next strokes."}, {"label": "Cell Activation Visualization", "description": "Click on a row in the heatmap of neuron activations to color the corresponding handwriting sample, revealing how that specific neuron's activity correlates with different stroke shapes."}, {"label": "Canvas Clearing", "description": "Click a button to clear the handwriting canvas to start a new drawing."}]}
{"field": "Algorithms", "url": "https://huggingface.co/spaces/marimo-team/seam-carving", "topic": "Content-aware image resizing using seam carving", "interaction_forms": [{"label": "Image Selection", "description": "Users can select from a set of preset images or upload their own, which updates the image being resized in the application."}, {"label": "Target Size Control", "description": "A slider allows users to interactively set the target width or height of the image, causing the visualization to dynamically update as seams are added or removed."}, {"label": "Operation Mode", "description": "Radio buttons allow users to switch between shrinking and expanding the image, which changes whether seams are removed from or added to the image."}, {"label": "Resizing Axis", "description": "Users can choose to resize the image's width or height, which determines whether vertical or horizontal seams are processed."}, {"label": "Energy Function Selection", "description": "A dropdown menu enables users to select the energy function for seam calculation, which alters the visual result of the resizing process."}, {"label": "Seam Visibility", "description": "A checkbox allows users to toggle the visibility of the seams being carved or inserted on the output image."}]}
{"field": "Algorithms", "url": "http://www.redblobgames.com/", "topic": "Interactive visual explanations of math and algorithms", "interaction_forms": [{"label": "Article Navigation", "description": "Clicking on a title navigates to a dedicated page containing an interactive article or demonstration."}]}
{"field": "Algorithms", "url": "http://www.redblobgames.com/pathfinding/a-star/introduction.html", "topic": "Graph pathfinding with A* search", "interaction_forms": [{"label": "Set Start & Goal", "description": "Dragging the start and goal markers to different locations on the map causes the visualization to recalculate and display the new shortest path."}, {"label": "Toggle Obstacles", "description": "Clicking on a grid cell toggles it between being an impassable wall or walkable terrain, forcing the pathfinding algorithm to find a route around the new obstacle."}, {"label": "Animate Frontier Expansion", "description": "Pressing a button starts an animation that shows the step-by-step expansion of the algorithm's search area, known as the frontier, across the map."}, {"label": "Step Through Expansion", "description": "Using forward and backward buttons allows for manually stepping through the algorithm's execution one step at a time to observe how the frontier expands."}]}
{"field": "Algorithms", "url": "http://www.redblobgames.com/grids/hexagons/", "topic": "Hexagonal grid mathematics and algorithms", "interaction_forms": [{"label": "Select Grid Orientation", "description": "Radio buttons switch the grid between \"flat top\" and \"pointy top\" orientations, which updates the layout and related calculations in the diagrams."}, {"label": "Hover Grid Cells", "description": "Moving the mouse cursor over a hexagon highlights it and dynamically displays contextual information such as its coordinates, neighbors, distance, or path from a central point."}, {"label": "Select Coordinate System", "description": "Dropdowns and radio buttons change the coordinate system being displayed (e.g., Offset, Axial, Doubled), updating the labels and conversions shown on the grid."}, {"label": "Highlight Axes", "description": "Buttons for each primary axis (q, r, s) highlight all the hexagonal cells that lie along the corresponding line extending from the origin."}, {"label": "Adjust Numeric Value", "description": "Sliders and input fields allow changing numerical parameters like range, radius, angle, or pixel dimensions, causing the visualization to dynamically update in response."}, {"label": "Define Obstacles", "description": "Clicking or dragging on grid cells toggles them as impassable walls, which immediately affects visualizations for pathfinding, movement range, and field of view."}, {"label": "Define Regions", "description": "Draggable handles or interactive selection defines starting points, endpoints, or centers of regions, which recalculates and redraws lines, movement areas, or intersecting ranges."}, {"label": "Select Reflection Axis", "description": "Radio buttons for each axis (q, r, s) set the line of reflection, and hovering over a hex shows its symmetrically reflected position."}, {"label": "Select Map Shape", "description": "A dropdown menu changes the overall shape of the map (rectangle, hexagon, etc.) to demonstrate different data storage configurations and their impact on wasted space."}, {"label": "Pan Wraparound Map", "description": "Dragging the grid demonstrates seamless wrapping by showing mirrored maps that enter from the opposite side as the user pans off an edge."}]}
{"field": "Algorithms", "url": "http://www.redblobgames.com/pathfinding/grids/graphs.html", "topic": "Representing grids as abstract graphs", "interaction_forms": [{"label": "Toggle view", "description": "Clicking the toggle button switches the visualization between an abstract, non-geometric layout and a structured grid layout to demonstrate that both views represent the identical underlying graph structure."}]}
{"field": "Algorithms", "url": "http://davidbkemp.github.io/QuantumComputingArticle/", "topic": "Qubit states, superposition, and quantum gates", "interaction_forms": [{"label": "Bit-flip NOT gate", "description": "Clicking the 'Not' button for a specific bit flips its state between 0 and 1, which is shown by moving an indicator to the resulting two-bit state."}, {"label": "Probabilistic NOT gate", "description": "Pressing the 'Random NOT' button updates the probabilities of a bit being in state 0 or 1, represented by the changing radii of two state disks."}, {"label": "Measurement", "description": "The 'Measure' button collapses a system from a state of probability or superposition into a single definite state, with the outcome's probability of being chosen determined by its disk's radius."}, {"label": "Hadamard gate", "description": "Applying the 'Hadamard' operator puts a qubit from a definite state (0 or 1) into an equal superposition of both, visualized by splitting it into two states with arrows indicating their phase."}, {"label": "T gate", "description": "The 'Apply T' button rotates the phase of the '1' state of a qubit in superposition, which is visualized by changing the direction of the arrow for that state."}, {"label": "Quantum interference", "description": "Applying the 'Hadamard' gate a second time causes the qubit's possible outcome paths to interfere, resulting in the cancellation of certain states and returning the qubit to its original definite state."}]}
{"field": "Algorithms", "url": "https://thebookofshaders.com/", "topic": "Programming real-time graphics with fragment shaders", "interaction_forms": [{"label": "Live Code Editing", "description": "Users can directly edit the GLSL shader code in a text window, and the adjacent visual output canvas updates in real-time to reflect the changes."}, {"label": "Mouse Position Input", "description": "Moving the mouse cursor over the visual output canvas directly influences the rendered graphics, as the shader code uses the mouse's coordinates as a uniform input."}, {"label": "Animated Time Input", "description": "The shader's visual output continuously animates and evolves based on a persistent time variable that is automatically passed into the shader as a uniform."}, {"label": "Theme Toggling", "description": "Clicking the light switch icon toggles the website's entire user interface between a light and a dark theme."}]}
{"field": "Science", "url": "http://ncase.me/simulating/", "topic": "Cellular automata and emergent systems", "interaction_forms": [{"label": "Direct Grid Manipulation", "description": "Clicking on any cell in the grid directly changes its current state to a different state selected from the drawing palette."}, {"label": "Simulation Playback Control", "description": "The simulation can be paused, stepped through one frame at a time, reset to its initial configuration, or run at varying speeds using playback buttons."}, {"label": "Agent and Rule Definition", "description": "Users can create new types of agents (represented by emojis), delete them, and define their behavior by adding or removing rules for state transitions."}, {"label": "Conditional Rule Editing", "description": "Each rule's logic can be edited to trigger state changes based on probabilistic chances or conditions related to the number and type of neighboring agents."}, {"label": "Global World Configuration", "description": "The simulation's global parameters can be changed, including the grid's dimensions, the initial ratio of agents, and the neighborhood type (4-way or 8-way)."}, {"label": "Preset Model Loading", "description": "A variety of preset models can be loaded by clicking on example links, which populates the simulator with pre-made agents and rules."}]}
{"field": "Science", "url": "http://ncase.me/neurons/", "topic": "How neurons form connections and learn through association", "interaction_forms": [{"label": "Advance Explanation", "description": "Clicking the 'next' arrow progresses the narrative, sequentially revealing new concepts and interactive neural diagrams."}, {"label": "Fire a Neuron", "description": "Clicking a sensory neuron sends a signal through its axon to a connected neuron, demonstrating the basic firing mechanism."}, {"label": "Adjust Synaptic Weight", "description": "Clicking and dragging on a synapse between two neurons directly strengthens or weakens the connection, affecting how likely the receiving neuron is to fire."}, {"label": "Simulate Simultaneous Firing", "description": "Clicking multiple input neurons at the same time causes them to fire together, which strengthens their connections to a common target neuron when it also fires."}, {"label": "Induce Negative Feedback", "description": "Activating a neural pathway that leads to a \"pain\" neuron's firing triggers a prompt to weaken the responsible synaptic connection by dragging its weight downwards."}]}
{"field": "Science", "url": "http://www.playfulinvention.com/emergence/index.html", "topic": "Emergence of patterns from simple rules", "interaction_forms": [{"label": "Start Simulation", "description": "Clicking 'Start' initiates a process where individual squares on the screen turn on and off according to simple rules, creating the emergent effect of a larger object moving across the screen."}]}
{"field": "Science", "url": "http://shaunlebron.github.io/visualizing-projections/", "topic": "Methods for projecting a 2D space onto a 1D line", "interaction_forms": [{"label": "Manipulate objects under standard projection", "description": "Dragging the colored circles in the 2D scene moves their projected representations on the flat 1D line."}, {"label": "Manipulate objects under panoramic projection", "description": "Dragging the colored circles in the 2D scene moves their projected representations on the 1D line captured from a cylindrical film."}, {"label": "Manipulate objects under hybrid projection", "description": "Dragging the colored circles in the 2D scene moves their projected representations on the 1D line captured using a two-camera stereographic method."}]}
{"field": "Science", "url": "https://aatishb.github.io/entropy/", "topic": "The statistical interpretation of entropy and the second law of thermodynamics", "interaction_forms": [{"label": "Manual Arrangement of Sheep", "description": "Dragging individual sheep between different plots of land allows users to manually find all possible arrangements for a small-scale system, with a counter tracking the number of unique configurations discovered."}, {"label": "Scaling System Size", "description": "Pressing buttons to add more 'sheep' or 'plots of land' updates a calculation to show how the total number of possible arrangements grows exponentially as the number of particles or energy states increases."}, {"label": "Simulating Energy Exchange", "description": "Clicking the visualization starts a simulation of sheep randomly moving between two farms, while a histogram on the side populates in real-time to show the changing distribution of sheep."}, {"label": "Adjusting Simulation Speed", "description": "Buttons are provided to increase the speed of the sheep simulation, allowing for faster observation of how the system's state distribution evolves over time towards the most probable outcomes."}, {"label": "Exploring Macro-Scale Effects", "description": "Adjusting the number of energy packets and atoms dynamically updates a bar chart of arrangements, showing how the probability distribution becomes more sharply peaked as the system scales up."}]}
{"field": "Science", "url": "http://dood.al/pinktrombone/", "topic": "Acoustic phonetics and speech synthesis", "interaction_forms": [{"label": "Oral Cavity and Tongue Shape", "description": "Dragging the tongue body with the mouse alters the shape of the oral cavity, which continuously changes the vowel sound produced."}, {"label": "Nasal Cavity Control", "description": "Clicking a constriction point at the velum opens or closes the nasal passage, toggling the sound's nasality."}, {"label": "Vocal Tract Constriction", "description": "Touching different locations inside the vocal tract creates temporary constrictions, which produces various consonant sounds."}, {"label": "Glottal Source Control", "description": "Manipulating the glottis at the base of the tract with the mouse adjusts the pitch and intensity of the vocal fold vibrations."}]}
{"field": "Science", "url": "https://ciechanow.ski/gps/", "topic": "The operational principles of the Global Positioning System", "interaction_forms": [{"label": "Satellite Constellation", "description": "Dragging the 3D view rotates the model of the Earth and the surrounding GPS satellite constellation."}, {"label": "Positioning Figurine", "description": "Dragging either the figurine or the landscape moves the user's position, which updates the location and size of uncertainty circles on a corresponding map, or changes the 3D viewing angle."}, {"label": "Time of Flight Drone", "description": "Moving a time slider animates a drone's flight from a landmark to the user, with a timeline bar showing the travel time that corresponds to the distance."}, {"label": "Two-Drone Trilateration", "description": "Advancing a time slider causes two drones to fly to the user's position, drawing range circles on a map as they arrive to identify the user's location at their intersection."}, {"label": "Sound Wave Measurement", "description": "A slider controls the propagation of a circular sound wave from the user, and a timeline measures the delay until the wave reaches surrounding landmarks."}, {"label": "Clock Bias", "description": "Adjusting a bias slider shifts the user's local clock time relative to the system time, which changes the calculated pseudorange and alters the radii of all range circles on the map."}, {"label": "Vertical Positioning", "description": "A slider changes the user figurine's altitude, which increases its distance to ground landmarks and causes their corresponding 2D range circles on a map to no longer intersect correctly."}, {"label": "3D Pseudorange Calculation", "description": "Moving a bias slider simultaneously changes the radii of four range spheres, showing that they only converge on a single point when the one correct clock bias value is selected."}, {"label": "Emitter Altitude", "description": "Dragging a slider changes the height of a signal emitter, demonstrating how increased altitude is required to overcome signal blockage from terrain."}, {"label": "Earth Curvature Masking", "description": "An altitude slider raises or lowers a satellite, altering the cone of signal coverage on the Earth's surface to show how higher orbits are needed to overcome the planet's curvature."}, {"label": "Gravitational Pull", "description": "Dragging and releasing an object at a static position in space causes it to accelerate directly toward the Earth's center due to gravity."}, {"label": "Orbital Trajectory", "description": "Dragging and releasing an object with an initial velocity sends it on a Keplerian orbit whose path is determined by the object's initial position and speed."}, {"label": "Ellipse Eccentricity", "description": "The focal points of an ellipse can be dragged closer together or further apart, which alters the ellipse's shape to demonstrate the concept of eccentricity."}, {"label": "Orbital Period", "description": "A slider for the semi-major axis adjusts the size of a satellite's elliptical orbit, which in turn changes the time it takes to complete one revolution."}, {"label": "Geosynchronous Orbit", "description": "An inclination slider adjusts the orbital plane of a geosynchronous satellite relative to the equator, changing its ground track from a fixed point to a figure-eight pattern."}, {"label": "Geostationary Coverage", "description": "A slider increases the number of satellites in geostationary orbit, and a heatmap on the globe visualizes how signal coverage improves in equatorial regions but remains absent at the poles."}, {"label": "Planar Orbit Ambiguity", "description": "Dragging a location point on the globe's surface reveals a symmetrical point on the opposite hemisphere that has the exact same set of distances to all satellites in a single orbital plane."}, {"label": "GPS Orbit Selection", "description": "Clicking different buttons allows for the display of either the entire GPS satellite constellation or only the satellites belonging to one of the six individual orbital planes."}, {"label": "Local Satellite Visibility", "description": "Dragging a point across the Earth's surface dynamically highlights which satellites from the global GPS constellation are currently within the line of sight for that specific location."}, {"label": "Relativistic Time Dilation", "description": "Adjusting a slider that controls a satellite's altitude demonstrates through competing progress bars how the net effect of special and general relativity causes the satellite's clock to run faster or slower than a clock on Earth."}, {"label": "Geometric Dilution of Precision", "description": "Sliders for measurement uncertainty and satellite positioning alter the intersection area of range circles, showing how positional accuracy is affected by both signal quality and the geometric spread of the visible satellites."}, {"label": "PRN Code Auto-correlation", "description": "Sliding a replica of a pseudorandom code against a repeating signal generates a correlation graph that shows a large spike only at perfect alignment, demonstrating signal timing detection."}, {"label": "PRN Code Cross-correlation", "description": "Sliding a replica of one satellite's code against another's signal produces a correlation graph with no significant peaks, demonstrating how signals from different satellites are distinguished."}, {"label": "Signal Acquisition and Decoding", "description": "The user can select a PRN code replica and adjust its time offset to find a correlation peak within a noisy, multi-satellite signal, which isolates and decodes the data from a single satellite."}]}
{"field": "Science", "url": "https://marimo.io/p/@gvarnavides/stem-probes", "topic": "Wave-optical simulation of electron scattering", "interaction_forms": [{"label": "Probe Position", "description": "Dragging the probe's location on the specimen simultaneously updates the diffraction pattern and detector image."}, {"label": "Microscope Defocus", "description": "Adjusting the defocus slider changes the phase of the electron probe, which is reflected in the probe image and diffraction pattern."}, {"label": "Spherical Aberration", "description": "Modifying the spherical aberration slider alters the shape of the electron probe, impacting the diffraction pattern and detector image."}, {"label": "Probe Convergence Angle", "description": "Changing the probe's convergence angle with a slider modifies the probe's size and the resolution of the resulting detector image."}]}
{"field": "Physics", "url": "https://arogozhnikov.github.io/2016/12/19/markov_chain_monte_carlo.html", "topic": "Markov Chain Monte Carlo sampling methods", "interaction_forms": [{"label": "Select Distribution", "description": "Clicking a distribution name from the dropdown menu changes the potential energy surface used for the probability distribution being sampled."}, {"label": "Select MCMC Method", "description": "Choosing between the 'Metropolis-Hastings' and 'Hamiltonian MC' radio buttons switches the algorithm used to generate samples from the distribution."}, {"label": "Toggle Sample Visibility", "description": "Checking or unchecking the 'generated samples', 'rejected samples', or 'true samples' boxes toggles the visibility of the corresponding points on the distribution plot."}, {"label": "Adjust Temperature", "description": "Dragging the 'temperature T' slider alters the temperature parameter, which sharpens or flattens the probability distribution and influences the sampler's acceptance probability."}, {"label": "Control Animation Speed", "description": "Selecting an option from the 'animation' dropdown changes the speed at which the sampling process is visualized."}, {"label": "Adjust Step Size", "description": "Dragging the 'step size σ' slider modifies the proposal distance for Metropolis-Hastings or the leapfrog step size for Hamiltonian Monte Carlo."}, {"label": "Adjust Slide Time", "description": "Dragging the 'slide time' slider adjusts the trajectory duration for each sample generated by the Hamiltonian Monte Carlo algorithm."}, {"label": "Adjust Tempering", "description": "Dragging the 'tempering α' slider modifies a parameter that scales the system's kinetic energy during a Hamiltonian Monte Carlo trajectory to help it cross energy barriers."}]}
{"field": "Science", "url": "https://marimo.io/p/@convex-optimization-nasa/trajectory-planning", "topic": "Trajectory optimization using Model Predictive Control (MPC)", "interaction_forms": [{"label": "Start and Goal State Sliders", "description": "Adjusting the sliders for the initial and final x/y positions and velocities recalculates and displays the optimal trajectory."}, {"label": "Obstacle Sliders", "description": "Dragging the sliders for the obstacle's position and radius redraws the obstacle and updates the trajectory to avoid it."}, {"label": "Solver Settings Sliders", "description": "Modifying sliders for solver parameters like the time horizon or weights for control costs re-solves and updates the displayed trajectory."}, {"label": "Run Button", "description": "Clicking the 'Run' button triggers the animation of the craft moving along the computed trajectory path."}]}
{"field": "Physics", "url": "http://ncase.me/birds/", "topic": "The effect of initial parameters on projectile trajectory", "interaction_forms": [{"label": "Horizontal Position", "description": "Dragging a slider horizontally changes the starting position of the projectile launch."}, {"label": "Launch Angle", "description": "Dragging a slider adjusts the initial angle of the projectile's launch, altering its flight path."}]}
{"field": "Physics", "url": "https://www.lucify.com/inside-einsteins-head/", "topic": "The relativity of simultaneity in spacetime", "interaction_forms": [{"label": "Scrub timeline", "description": "Dragging a slider scrubs the animation of the thought experiment forwards and backwards in time, showing the positions of the train and light pulses at any given moment."}, {"label": "Select event", "description": "Clicking on key events in a list jumps the animation to the specific moment in time that the event occurs from the current frame of reference."}, {"label": "Switch reference frame", "description": "Switching the observational point of view between the stationary bridge and the moving train changes the visualization to demonstrate how the simultaneity of events is relative to the observer."}]}
{"field": "Physics", "url": "https://shapescience.xyz/blog/interactive-introduction-to-optical-modulation/", "topic": "Digital modulation of optical signals", "interaction_forms": [{"label": "Change Symbol", "description": "Clicking on an interactive visualization queues a new random symbol to be transmitted, updating the corresponding animated waveform and constellation diagram to reflect the new symbol's properties."}, {"label": "Adjust Clock Frequency", "description": "Dragging the first interactive visualization horizontally changes the clock frequency, altering the temporal width of the symbols shown in the on-off keying waveform."}]}
{"field": "Physics", "url": "http://nuclearsecrecy.com/nukemap/", "topic": "The scale and effects of nuclear detonations", "interaction_forms": [{"label": "Detonation Location", "description": "Dragging a marker, selecting a preset city from a dropdown, or typing a city name into an input field moves the center of the simulated explosion on the map."}, {"label": "Weapon Yield", "description": "Entering a yield in kilotons or selecting a preset historical or contemporary weapon from a dropdown adjusts the size of the weapon for the simulation."}, {"label": "Detonation Type", "description": "Selecting between 'Airburst' and 'Surface' radio buttons changes the calculation of the weapon's effects, with airbursts maximizing blast range and surface bursts creating radioactive fallout."}, {"label": "Detonation Button", "description": "Pressing the 'Detonate' button renders the casualty, blast, thermal, and radiation radii as colored concentric circles on the map and, if selected, a fallout plume."}, {"label": "Casualties and Fallout Toggles", "description": "Checking boxes for 'Casualties' and 'Radioactive fallout' enables or disables the on-screen calculation and display of estimated fatalities and the geographic area affected by fallout."}, {"label": "Advanced Effects Customization", "description": "Within the 'Advanced options' panel, users can set specific airburst heights, add or remove rings for different overpressure levels, ionizing radiation doses, and thermal radiation energies, which adds or removes the corresponding circles from the map display."}]}
{"field": "Physics", "url": "https://phet.colorado.edu/", "topic": "A catalog of interactive simulations for science and math education", "interaction_forms": [{"label": "Simulation Filtering", "description": "Clicking on a subject icon, such as Physics or Math, filters the content to display interactive simulations relevant to that academic field."}, {"label": "Site Navigation", "description": "Users can click on main menu links like 'Simulations', 'Teaching', and 'Research' to navigate to different sections of the website."}, {"label": "Search", "description": "Entering keywords into the search bar allows users to find specific simulations or teaching resources available on the site."}, {"label": "Language Selection", "description": "Choosing a language from the provided list translates the website's text and navigation into the selected language."}, {"label": "User Registration and Sign-in", "description": "A user can register for an account or sign in to access personalized features like bookmarks and contributions."}]}
{"field": "Physics", "url": "https://www.myphysicslab.com/", "topic": "A catalog of interactive classical mechanics simulations", "interaction_forms": [{"label": "Simulation Selection", "description": "Clicking on a simulation's thumbnail image navigates to and loads that specific interactive physics simulation."}, {"label": "Language Toggle", "description": "Choosing between 'English' and 'German' reloads the page to display its text content in the selected language."}, {"label": "Carousel Navigation", "description": "Clicking the 'previous' and 'next' buttons cycles through the available pages of simulations."}]}
{"field": "Physics", "url": "https://pudding.cool/2018/02/waveforms/", "topic": "Waveform properties and additive synthesis", "interaction_forms": [{"label": "Adjust Volume", "description": "Users can change the sound's volume using a slider or keyboard shortcuts."}, {"label": "Adjust Amplitude", "description": "A slider allows users to change the amplitude of a waveform, which visually alters its height and audibly changes its loudness."}, {"label": "Adjust Frequency", "description": "A slider allows users to change the frequency of a waveform, which visually alters its period and audibly changes its pitch."}, {"label": "Select Waveform Type", "description": "Users can scroll through sections to select and compare different fundamental waveform shapes, such as sine, triangle, square, and sawtooth."}, {"label": "Adjust Waveform Convergence", "description": "A slider visually merges multiple sine waves into a single composite waveform to demonstrate the principle of additive synthesis."}, {"label": "Adjust Number of Harmonics", "description": "A slider allows users to add or remove harmonic sine waves to observe how they combine to approximate more complex waveforms."}, {"label": "Adjust Phase Offset", "description": "A slider offsets the phase of one of two identical sine waves, demonstrating phase cancellation when the waves are combined."}]}
{"field": "Physics", "url": "https://www.falstad.com/circuit/", "topic": "Electronic circuit simulation and analysis", "interaction_forms": [{"label": "Load Example Circuit", "description": "Selecting a circuit from the 'Circuits' dropdown menu replaces the current schematic with a pre-built example, demonstrating various electronic principles."}, {"label": "Add Circuit Component", "description": "Right-clicking on the canvas opens a context menu to add various electronic components, such as sources, resistors, and semiconductors, to construct a new circuit."}, {"label": "Edit Component Properties", "description": "Right-clicking a component and selecting 'Edit' opens a dialog to modify its electrical properties, such as resistance or voltage, which instantly updates the circuit's behavior."}, {"label": "Reposition and Reshape Component", "description": "Clicking and dragging a component moves it around the canvas, while dragging its endpoints alters its length and orientation."}, {"label": "Toggle Switch State", "description": "Clicking on a switch component toggles it between its open and closed states, altering the flow of current in the circuit."}, {"label": "Control Simulation Dynamics", "description": "Adjusting sliders changes the speed of the simulation and the visualization of current flow, while a checkbox allows the simulation to be paused or resumed."}, {"label": "Inspect Component Values", "description": "Hovering the mouse over any component or node displays its real-time electrical characteristics, such as voltage and current, in an information panel."}, {"label": "Plot Signals in Scope", "description": "Adding a scope to the circuit via the right-click menu generates time-domain plots of the voltage and current for the nodes it is connected to."}]}
{"field": "Psychology", "url": "http://ncase.me/trust/", "topic": "The evolution of cooperation and trust under game theory principles.", "interaction_forms": [{"label": "Choose an Action", "description": "Clicking on 'cooperate' or 'cheat' buttons advances a turn-based game, updating scores and character expressions based on the chosen action and the opponent's strategy."}, {"label": "Run a Tournament", "description": "Pressing a 'play' button initiates an evolutionary tournament where different strategies compete, and the population distribution visually changes over rounds to show which strategies succeed or fail."}, {"label": "Adjust Population", "description": "Clicking plus or minus buttons next to different character archetypes changes their counts in the starting population for the tournament simulation."}, {"label": "Modify Payoffs", "description": "Changing the values in the payoff matrix alters the rewards and penalties for the different outcomes of a game round, affecting the dynamics of subsequent simulations."}, {"label": "Introduce Mistakes", "description": "Adjusting a 'noise' slider sets the probability that a character will make a mistake in any given round, altering the outcomes of interactions in the simulation."}, {"label": "Set Round Count", "description": "Selecting a value from a dropdown menu changes the number of rounds played in each match, which can affect the viability of different strategies in the tournament."}]}
{"field": "Psychology", "url": "https://www.theguardian.com/australia-news/datablog/ng-interactive/2017/sep/28/hooked-how-pokies-are-designed-to-be-addictive", "topic": "Design principles of addictive poker machines", "interaction_forms": [{"label": "Trigger Reward", "description": "Clicking a button rewards the user with points, either on a fixed schedule where every click gives a reward or on a variable schedule where rewards are intermittent and unpredictable."}, {"label": "Toggle Sound", "description": "Clicking the sound icon at the top of the page turns the accompanying audio effects for the simulations on or off."}, {"label": "Spin Machine", "description": "Pressing a button spins the reels of various simulated poker machines, which then land on a combination of symbols to show a win, a loss, or a loss disguised as a win."}, {"label": "Play Expert Audio", "description": "Clicking the play icon on an embedded audio player plays a recording of an expert providing commentary on a specific concept."}, {"label": "Inspect Reel Layout", "description": "Tapping one of the three miniaturized reel graphics displays an enlarged, unrolled view of that reel's complete symbol layout."}, {"label": "Check Symbol Probability", "description": "Hovering over or tapping a symbol on an unrolled reel view highlights all instances of that symbol and displays its specific probability of appearing on that reel."}, {"label": "Adjust Bet and Lines", "description": "On the multi-line machine simulation, the user can change the number of lines to bet on from one to three before spinning the reels."}]}
{"field": "Systems And Thought Experiments", "url": "https://www.complexity-explorables.org/", "topic": "A curated collection of complex systems simulations", "interaction_forms": [{"label": "Filter by Topic", "description": "Clicking a category name or tag filters the gallery to show only the explorable explanations associated with that topic."}, {"label": "Select an Explorable", "description": "Clicking on the title or image of an explorable navigates to its specific interactive simulation page."}]}
{"field": "Systems And Thought Experiments", "url": "https://manytinythings.github.io/", "topic": "Emergent macroscopic properties from microscopic particle interactions", "interaction_forms": [{"label": "Attract", "description": "Clicking and dragging the cursor creates an attractive force that pulls particles towards it."}, {"label": "Repel", "description": "Clicking and dragging the cursor creates a repulsive force that pushes particles away from it."}, {"label": "Move", "description": "Clicking and dragging a particle directly changes its position within the simulation."}, {"label": "Impulse", "description": "Clicking and dragging from a particle applies an impulse, launching it in the direction of the drag."}, {"label": "Create", "description": "Clicking on an empty space in the simulation adds a new particle at that location."}, {"label": "Delete", "description": "Clicking on a particle removes it from the simulation."}, {"label": "Tool Selection", "description": "Clicking on a tool's name selects it, changing the interaction behavior of the cursor within the simulation."}]}
{"field": "Systems And Thought Experiments", "url": "http://ncase.me/ballot/", "topic": "Comparative analysis of voting systems", "interaction_forms": [{"label": "Move entities", "description": "Dragging candidates or the center of a voter crowd repositions them on a 2D political map, which updates the vote counts and election outcome in real-time."}, {"label": "Switch voting system", "description": "Clicking on a voting system's name (e.g., FPTP, IRV, Score) changes the ballot counting method, which recalculates and displays the new election winner based on the current voter and candidate positions."}, {"label": "Adjust voter groups", "description": "In the Condorcet simulation and Sandbox Mode, users can select the number of distinct voter groups (one, two, or three), causing the visualization to show separate, draggable crowds."}, {"label": "Adjust candidate count", "description": "In Sandbox Mode, clicking to change the number of candidates (from two to five) adds or removes candidates from the political map."}, {"label": "Edit scenario description", "description": "In Sandbox Mode, users can type into a text box to create a custom description for their election scenario."}, {"label": "Save scenario", "description": "Clicking the 'save' button in Sandbox Mode generates a unique URL that preserves the current positions of candidates, voters, and the custom description for sharing."}, {"label": "Reset simulation", "description": "Clicking the 'reset' button restores the current interactive simulation to its initial default state."}]}
{"field": "Systems And Thought Experiments", "url": "http://ncase.me/polygons/", "topic": "Individual bias and collective segregation", "interaction_forms": [{"label": "Drag and drop polygons", "description": "Dragging and dropping an \"unhappy\" polygon to an empty square moves it, which in turn can affect the happiness of its new and old neighbors."}, {"label": "Run simulation", "description": "Clicking the \"run\" button automatically moves all unhappy polygons to random empty spots until no polygons are unhappy, showing the emergent segregation on a graph."}, {"label": "Adjust bias threshold", "description": "Moving the slider changes the required percentage of similar neighbors for a polygon to be happy, which alters the conditions under which polygons will move during the simulation."}, {"label": "Reset simulation", "description": "Clicking the \"reset\" button returns the polygons to a new random arrangement on the grid according to the current rules."}, {"label": "Move polygon pairs", "description": "Dragging a polygon that is part of a pair moves both polygons together, allowing the user to solve a puzzle by maneuvering them into a target area."}, {"label": "Adjust population parameters", "description": "Manipulating sliders in the sandbox mode changes the ratio of different polygon types and the percentage of empty space on the grid for open-ended experimentation."}]}
{"field": "Creativity", "url": "http://ncase.me/joy-demo/", "topic": "Reactive data binding and bidirectional relationships", "interaction_forms": [{"label": "Adjusting a data-bound slider", "description": "Dragging the slider's handle directly manipulates the underlying data value, which in turn updates any visual elements linked to it."}, {"label": "Dragging a data-bound object", "description": "Dragging a visual element in the output area updates its position, which in turn updates the underlying data value and any other elements linked to it, including the slider."}, {"label": "Editing the data binding code", "description": "Modifying the code that defines the relationships between data and visual elements changes how they react to each other's updates."}, {"label": "Creating new data-bound elements", "description": "Adding new code to the editor allows for the creation of new visual elements that are reactively linked to the existing data model."}]}
{"field": "Creativity", "url": "http://recursivedrawing.com/", "topic": "Defining recursive functions through drawing", "interaction_forms": [{"label": "Draw Base Shape", "description": "Users can draw a freeform shape onto the canvas, which serves as the base element for the recursion."}, {"label": "Draw Transformation Example", "description": "Dragging the initial shape creates a transformed copy, and the geometric difference between the original and the copy defines the recursive transformation to be applied."}, {"label": "Adjust Recursion Depth", "description": "A slider controls the number of recursive steps, adding or removing instances of the transformed shape in the drawing."}, {"label": "Animate Recursion", "description": "A play button animates the recursive drawing process, sequentially revealing each step of the recursion over time."}, {"label": "Modify Base Shape", "description": "Manipulating the points of the original base shape causes the entire recursive pattern to update in real-time to reflect the changes."}, {"label": "Modify Transformation", "description": "Manipulating the transformed copy of the shape interactively changes the recursive rule, causing the entire pattern to update accordingly."}]}
{"field": "Other", "url": "https://learningmusic.ableton.com/", "topic": "The building blocks of musical patterns and composition", "interaction_forms": [{"label": "Toggling Loops", "description": "Clicking on cells within a grid turns musical loops on or off, allowing for the exploration of different combinations of sounds."}, {"label": "Sequencing Events", "description": "Adding or removing notes on a time-based grid sequencer creates and modifies musical patterns like drum beats, basslines, and melodies."}, {"label": "Note Manipulation", "description": "Notes on a piano roll can be dragged vertically to change their pitch or horizontally to alter their timing."}, {"label": "Adjusting Tempo", "description": "Modifying a tempo control changes the speed of playback, with genre labels updating to reflect common uses for that tempo."}, {"label": "Copying Patterns", "description": "Users can copy existing musical patterns to different locations in the sequencer to repeat or extend musical ideas."}, {"label": "Toggling Scene Playback", "description": "Clicking 'play' buttons for different horizontal rows (scenes) triggers the playback of a pre-composed collection of musical patterns."}]}
{"field": "Other", "url": "https://kevinhayeswilson.com/redraw/", "topic": "Electoral vote allocation based on county districting", "interaction_forms": [{"label": "Select/Deselect County", "description": "Clicking a county toggles its selection, while holding 'q' or 'w' and mousing over counties allows for continuous selection or deselection."}, {"label": "Move Counties", "description": "After selecting counties, activating the 'Move' button and then clicking a destination state reassigns the counties and recalculates the electoral map and votes."}, {"label": "Change Election Data", "description": "Choosing a different election year from the available buttons updates the map and the data table to reflect the results of that specific election cycle."}, {"label": "Toggle County Borders", "description": "Clicking the 'Hide Counties' button toggles the visibility of the county boundary lines on the map."}]}
{"field": "Other", "url": "http://type.method.ac/", "topic": "Kerning and letter spacing", "interaction_forms": [{"label": "Letter Dragging", "description": "Users can drag the middle letters of a word left or right to adjust the horizontal spacing between them."}, {"label": "Solution Comparison", "description": "Clicking a button reveals the ideal typographic solution and a score based on the user's letter placement."}, {"label": "Keyboard Nudging", "description": "The selected letter's position can be finely adjusted using the left and right arrow keys for precise spacing control."}, {"label": "Word Navigation", "description": "Users can advance to different words to practice kerning on a new set of letters."}]}
{"field": "Other", "url": "https://thomas-tanay.github.io/posts/2022-SFCmodel", "topic": "Stock-flow consistent macroeconomic modeling", "interaction_forms": [{"label": "Adjusting Model Parameters", "description": "Dragging any of the six sliders for government spending, tax rate, or firms' and households' spending levels on income and savings updates the system's stock levels and fund flows in real-time, showing how the economy converges to a new equilibrium."}, {"label": "Resetting Simulation", "description": "Clicking the 'reset stocks' button sets all stock values to zero and restarts the simulation, allowing the user to observe the system's evolution from its initial state."}, {"label": "Loading Scenarios", "description": "Clicking on the different model state links automatically sets the six parameter sliders to pre-configured values that demonstrate distinct economic conditions and their outcomes."}]}
{"field": "Other", "url": "http://viruspatterns.com/", "topic": "The principles of icosahedral symmetry in virus capsid construction.", "interaction_forms": [{"label": "Virus Selection", "description": "Clicking a virus name loads and displays its corresponding 3D model."}, {"label": "Model Rotation", "description": "Dragging the mouse horizontally or vertically rotates the 3D virus model."}, {"label": "Capsid Folding", "description": "A slider control allows for the continuous folding and unfolding of the virus's 2D geometric net into its 3D capsid structure."}, {"label": "Symmetry Axis Visualization", "description": "Buttons can be toggled to show or hide the 2-fold, 3-fold, and 5-fold symmetry axes on the model."}, {"label": "T-Number Selection", "description": "Users can change the triangulation number (T-number) to observe how it alters the geometric arrangement of proteins in the capsid."}, {"label": "Information Overlay", "description": "Clicking on different parts of the model reveals detailed information about that specific structural component."}]}
{"field": "Other", "url": "https://ciechanow.ski/mechanical-watch/", "topic": "The inner workings of a mechanical watch movement.", "interaction_forms": [{"label": "Viewing Angle", "description": "Dragging the watch movement demonstration changes the 3D viewing perspective."}, {"label": "Cross-Section Slider", "description": "A global slider at the top of the page adjusts the cross-section view, revealing the internal components of the watch movement."}, {"label": "Pause/Unpause Animations", "description": "A global control allows the user to pause or resume all animations throughout the article."}, {"label": "Spring Interaction", "description": "Users can drag a mass attached to a coil spring to observe its oscillation."}, {"label": "Torsion Spring Winding", "description": "A slider allows the user to wind a spiral torsion spring, which unwinds when the slider is released."}, {"label": "Mainspring Winding", "description": "Dragging a slider winds the mainspring, and releasing it causes the attached arbor or barrel to spin back."}, {"label": "Gear Ratio Adjustment", "description": "Sliders or buttons allow the user to change the ratio of teeth between two gears to see how it affects their relative rotation speed."}, {"label": "Gear Train Zoom", "description": "A slider zooms the view out to show the impractical size of a simple two-gear system with a large ratio."}, {"label": "Gear Train Speed Control", "description": "A slider controls the speed of rotation of a multi-gear train."}, {"label": "Pallet Fork Control", "description": "Buttons labeled 'Tick' and 'Tock' allow the user to manually pivot the pallet fork, releasing the escape wheel one tooth at a time."}, {"label": "Oscillator Parameter Adjustment", "description": "Sliders for 'Stiffness' and 'Moment of Inertia' let the user modify the parameters of a balance wheel to see the effect on its oscillation period."}, {"label": "Slow-Motion Scrubber", "description": "A slider scrubs through a slow-motion animation of the balance wheel interacting with the pallet fork and escape wheel."}, {"label": "Time Scrubber", "description": "A slider moves time forward and backward to demonstrate how the date-changing mechanism engages around midnight."}, {"label": "Crown Operation", "description": "A slider is used to pull the crown in and out to select different modes (winding, date setting, time setting), and another interaction demonstrates turning the crown to perform the selected action."}, {"label": "Automatic Winding Simulation", "description": "Dragging the entire watch assembly around simulates movement, causing the automatic winding weight to rotate due to gravity."}, {"label": "Unidirectional Gear Simulation", "description": "A slider rotates the input gear of the automatic winding mechanism back and forth, demonstrating how the output gear only turns in one direction."}, {"label": "Magnification Slider", "description": "A final slider changes the magnification of the watch movement, comparing its size to a credit card outline to provide a sense of scale."}]}
{"field": "About Explorable Explanations", "url": "http://explorableexplanations.com", "topic": "The philosophy and collection of interactive learning modules.", "interaction_forms": [{"label": "Random Explorable Loading", "description": "Clicking the 'load three more!' button dynamically displays a new set of three random explorables from the collection."}, {"label": "Subject Filtering", "description": "Clicking on a subject name, such as 'math' or 'physics', filters the displayed list to show explorables related to that category."}, {"label": "Explorable Selection", "description": "Clicking on the title of a featured explorable navigates the user to that specific interactive page."}, {"label": "Complete Listing", "description": "Clicking the 'ALL OF IT' link navigates to a single page that lists all available explorables."}]}
{"field": "About Explorable Explanations", "url": "http://worrydream.com/ScientificCommunicationAsSequentialArt/", "topic": "The small-world network model", "interaction_forms": [{"label": "Rewiring Probability", "description": "Scrubbing the rewiring probability value 'p' visually transforms the network diagram's edges from an ordered to a random state."}, {"label": "Network Property Plot", "description": "Sweeping the cursor across the main chart displays the corresponding values for path length and clustering coefficient for a given probability 'p' while showing a thumbnail of that network's structure."}, {"label": "Path Highlighting", "description": "Mousing over a text label describing a network 'shortcut' highlights the corresponding shorter path between two nodes in the accompanying diagram."}]}
{"field": "About Explorable Explanations", "url": "http://worrydream.com/LadderOfAbstraction/", "topic": "Relating concrete and abstract representations of a system.", "interaction_forms": [{"label": "Animate Simulation", "description": "Clicking a button runs the simulation forward in real-time."}, {"label": "Control Time", "description": "Dragging a slider scrubs the simulation back and forth through time, showing the state at any given moment."}, {"label": "Adjust Algorithm Parameter", "description": "Dragging a slider adjusts a core algorithm variable, causing the system's entire calculated behavior to update instantly."}, {"label": "Inspect Trajectory", "description": "Hovering the cursor along a trajectory path displays the system's concrete state at that specific point in time."}, {"label": "Correlate Plot and Visualization", "description": "Mousing over a data point in a summary chart highlights the corresponding behavior in the main visualization, connecting a performance metric to its spatial outcome."}, {"label": "Adjust Data Parameter", "description": "Dragging a slider modifies a parameter of the environment data, which in turn recalculates and redraws the system's resulting behavior."}, {"label": "Link Multiple Abstractions", "description": "Interacting with any one visualization simultaneously updates all other linked views, showing the same state from different levels of abstraction."}, {"label": "Inspect Heatmap Point", "description": "Hovering the cursor over a point on a two-dimensional heatmap shows the specific behavior that results from the two parameters represented by that point."}, {"label": "Inspect Heatmap Axis", "description": "Hovering the cursor over one axis of a two-dimensional heatmap shows a collection of all behaviors that share the parameter value from that axis."}, {"label": "Manipulate Code Values", "description": "Dragging numerical literals directly within a snippet of code instantly updates the graphical output generated by that code."}]}
{"field": "About Explorable Explanations", "url": "http://worrydream.com/ExplorableExplanations/", "topic": "Integrating computational models with explanatory text", "interaction_forms": [{"label": "Embedded Variable Manipulation", "description": "Dragging underlined words or numbers directly within the text alters the parameters of an underlying model, causing dependent calculations and conclusions in the document to update immediately."}, {"label": "Live Parameter Adjustment", "description": "Adjusting numerical inputs for a system's parameters results in the real-time update of multiple, linked graphical representations of that system's behavior."}, {"label": "Representation Toggling", "description": "Clicking a switch instantly changes a specific visualization panel to an alternative representation of the system's output."}, {"label": "Contextual Information Retrieval", "description": "Activating a keyboard command on a selected word opens an overlay with external search results, enabling readers to verify claims or explore concepts without leaving the page."}]}
{"field": "About Explorable Explanations", "url": "http://blog.ncase.me/explorable-explanations/", "topic": "Design patterns for explorable explanations", "interaction_forms": [{"label": "Reading Mode Controls", "description": "Users can alter the page's visual presentation by activating dark mode, changing the font size, and switching the font type between serif and sans-serif."}]}
{"field": "Tools And Resources", "url": "http://explorabl.es/", "topic": "A curated collection of explorable explanations", "interaction_forms": [{"label": "Randomized Loading", "description": "Users can click a button to dynamically load a new set of three random explorable explanations."}, {"label": "Subject Filtering", "description": "Clicking on a subject name navigates to a page showing all explorables categorized under that topic."}, {"label": "Resource Navigation", "description": "Users can click links to access resources for creating their own explorables or to view the entire collection on a single page."}]}
{"field": "Tools And Resources", "url": "http://aprt.us/", "topic": "Parametric creation of interactive diagrams", "interaction_forms": [{"label": "Programmatic Property Binding", "description": "Users define the behavior of graphical objects by writing Javascript expressions into their property fields, creating dynamic relationships between them."}, {"label": "Interactive Widget Manipulation", "description": "The created diagrams can be manipulated through interactive elements like sliders, color pickers, and draggable points, causing the rest of the parametrically-linked diagram to update in real time."}]}
{"field": "Tools And Resources", "url": "http://tomasp.net/coeffects/", "topic": "Modeling program context with coeffects", "interaction_forms": [{"label": "Content Display Toggle", "description": "Users can click buttons to expand or collapse sections of the tutorial, tailoring the level of detail shown."}, {"label": "Sample Loading", "description": "Clicking a 'load' button next to an example populates an adjacent code editor with the corresponding sample code."}, {"label": "Code Snippet Execution", "description": "Users can write or load code into an editor, check its validity, provide inputs in text fields, and run the program to see the resulting output."}, {"label": "Live Dataflow Input", "description": "Moving a mouse or finger over a designated area provides a live stream of X and Y coordinates as input to a dataflow program, with the output rendered continuously on a chart."}, {"label": "Interactive Type Derivation", "description": "After checking a code snippet, the system displays a formal type derivation tree, and users can click on different parts of the tree to navigate and explore the steps of the type-checking process."}, {"label": "Grid Transformation", "description": "Clicking a button transforms a grid of numbers by applying a function to each cell based on the values of its neighbors."}]}
{"field": "Tools And Resources", "url": "http://ncase.me/improv-wip/", "topic": "A framework for creating user-programmable interactive models", "interaction_forms": [{"label": "Adjust number with a slider", "description": "Dragging a number slider for a parameter, such as flock size or movement speed, dynamically changes the corresponding value in the simulation."}, {"label": "Select option from a dropdown", "description": "Choosing an option from a dropdown menu, such as boid color or a rule's target, instantly applies that selection to all agents in the simulation."}, {"label": "Add a behavior rule", "description": "Clicking the '+new' button and selecting an action from the popup menu adds a new rule to the agents' behavior program."}, {"label": "Remove a behavior rule", "description": "Clicking the '⨂' button next to a behavior rule immediately removes it from the program, and the agents' movement updates accordingly."}, {"label": "Nest behavior rules", "description": "Adding a new action within a conditional rule creates a nested behavior that only executes when the parent condition is met."}]}
{"field": "Tools And Resources", "url": "http://idyll-lang.org/", "topic": "Reactive variable binding in markup for interactive documents", "interaction_forms": [{"label": "Button Selection", "description": "Clicking a button updates a variable that changes the function being rendered in the chart from a sine to a cosine wave."}, {"label": "Range Sliders", "description": "Dragging a slider's handle updates the start or end value of the plotted function's domain, causing the chart to redraw over the new range."}, {"label": "Equation Input", "description": "Typing a JavaScript function into the text input field causes the chart to dynamically update and render the newly entered equation."}]}
{"field": "Tools And Resources", "url": "https://iooxa.dev", "topic": "Payment and withdrawal methods for online casinos", "interaction_forms": []}
{"field": "Tools And Resources", "url": "http://lively-kernel.org", "topic": "A self-sustaining, web-based programming and application environment.", "interaction_forms": [{"label": "Hyperlink Navigation", "description": "Clicking on text links navigates the user to different pages within the website, such as 'Lively', 'Publications', or 'Projects'."}]}
{"field": "Tools And Resources", "url": "http://ncase.me/loopy/", "topic": "Systems thinking and feedback loops", "interaction_forms": [{"label": "Create Node", "description": "Clicking on any empty part of the canvas adds a new circular node to the diagram."}, {"label": "Modify Node", "description": "Clicking a node reveals a menu to change its name and color, delete it, or adjust its initial value by dragging the node vertically."}, {"label": "Create Relationship", "description": "Dragging the mouse from one node to another creates a directed arrow, establishing a relationship between them."}, {"label": "Modify Relationship", "description": "Clicking an arrow's handle opens a menu to change the relationship's sign (positive or negative) or to delete it."}, {"label": "Create Label", "description": "Double-clicking on any empty space creates a movable and editable text label."}, {"label": "Run Simulation", "description": "Clicking the 'Play' button animates the diagram, showing the fill level in each node changing over time according to the defined relationships."}, {"label": "Pause Simulation", "description": "While the simulation is running, clicking the 'Stop' button freezes the animation at its current state."}, {"label": "Reset Simulation", "description": "Clicking the 'Reset' button reverts all nodes to their initial, user-defined values."}, {"label": "Move Elements", "description": "Any node or text label can be freely repositioned by dragging it around the canvas."}]}
{"field": "Tools And Resources", "url": "http://worrydream.com/Tangle/", "topic": "Reactive documents with manipulable variables", "interaction_forms": [{"label": "Draggable Numbers", "description": "Users can click and drag on specially marked numbers within the text to interactively adjust their values within a predefined range."}, {"label": "Reactive Text Updates", "description": "When a number is manipulated, dependent numerical values and surrounding descriptive text are recalculated and updated in real-time to reflect the change."}, {"label": "Dynamic Chart Generation", "description": "Visual graphs and plots dynamically redraw themselves to illustrate the effects of changes made to the controlling numerical variables."}]}
{"field": "Tools And Resources", "url": "http://bollwyvl.github.io/TangleDown/", "topic": "Reactive documents with embedded variables", "interaction_forms": [{"label": "Adjust Cookie Count", "description": "Dragging the number of cookies horizontally changes its value, which dynamically recalculates the total calories consumed, updates the percentage of the daily intake, and conditionally displays a text message if the calories exceed a certain threshold."}, {"label": "Adjust Daily Calorie Intake", "description": "Dragging the number for the daily calorie goal horizontally changes its value, which updates the calculation of the cookie's percentage relative to this total."}]}
{"field": "Tools And Resources", "url": "http://marimo.io", "topic": "Reactive and interactive Python notebooks", "interaction_forms": [{"label": "Reactive Code Execution", "description": "Editing the code within a cell automatically triggers the re-execution of that cell and all other cells that depend on its output."}, {"label": "UI Element Binding", "description": "Manipulating UI elements like sliders, dropdowns, or buttons instantly updates the values of bound variables and reactively reruns dependent cells."}, {"label": "Interactive Plotting", "description": "Selecting data points or brushing over regions in a plot can filter or update the data displayed in other visualizations and tables."}, {"label": "SQL Cell Querying", "description": "Writing and executing queries in dedicated SQL cells retrieves and updates data from sources like DuckDB, with dependent Python cells updating automatically."}, {"label": "AI-Assisted Development", "description": "Using an integrated AI copilot or chat allows for context-aware code generation, inline edits, and automated assistance within the notebook environment."}, {"label": "Theme Toggling", "description": "Clicking the theme toggle switches the user interface of the webpage between a light and dark mode."}]}
{"field": "Tools And Resources", "url": "https://marimo.io/gallery/", "topic": "Gallery of reactive and interactive data applications", "interaction_forms": [{"label": "Text Search", "description": "Typing text into the search bar dynamically filters the displayed applications to show only those with matching titles."}, {"label": "Category Filtering", "description": "Clicking on a category name filters the gallery to display only the applications belonging to that selection."}, {"label": "Application Selection", "description": "Clicking on an application's thumbnail navigates to the corresponding interactive notebook page."}, {"label": "Theme Toggling", "description": "Clicking the theme toggle button switches the website's user interface between light and dark modes."}]}
{"field": "Tools And Resources", "url": "https://marimo.new/", "topic": "Reactive execution in Python notebooks", "interaction_forms": [{"label": "Code Cell Modification", "description": "Modifying the code within a cell automatically triggers the re-execution of all dependent cells."}, {"label": "UI Element Manipulation", "description": "Interacting with UI elements, such as sliders, updates their bound variables and causes dependent cells to rerun."}, {"label": "Execution Mode Toggle", "description": "Toggling the autorun setting on cell changes enables or disables the automatic reactive execution of the notebook."}, {"label": "Minimap Navigation", "description": "Clicking on a cell within the minimap navigates the user's view directly to that cell in the notebook."}, {"label": "AI-Powered Generation", "description": "Using the AI generation feature allows users to create code by providing a natural language prompt."}]}
{"field": "Books And Essays", "url": "http://blog.ncase.me/environment-economy/", "topic": "The relationship between environmental and economic systems through feedback loops.", "interaction_forms": [{"label": "Running the simulation", "description": "Clicking the 'Play' button animates the flow of influence between nodes, causing their levels to change over time based on the defined system dynamics."}, {"label": "Adjusting initial conditions", "description": "Clicking on a node and dragging vertically changes its starting value, which alters the outcome of the simulation when it is run."}, {"label": "Resetting the simulation", "description": "Pressing the 'Reset' button reverts all nodes in the system back to their original predefined starting values."}, {"label": "Remixing the system model", "description": "Activating the 'Remix' mode allows for editing the causal loop diagram itself by adding or deleting nodes and arrows, as well as modifying their properties to create new system models."}]}
{"field": "Physics", "url": "https://www.falstad.com/mathphysics.html", "topic": "An index of mathematical, physical, and engineering applets", "interaction_forms": [{"label": "Navigate to Applet", "description": "Clicking a link loads an interactive educational applet for visualizing a specific concept."}]}
{"field": "Algorithms", "url": "http://gamejolt.com/games/the-stranger-loop/10679", "topic": "Universe topology and four-dimensional objects", "interaction_forms": []}
